const query = require('../utils/pool');
const city = {};
exports.city = city;

//获取轮播图
city.all = function(req, res, next) {
  req.body.data = [
    {fon: '热门城市', citys: ['上海', '北京', '广州', '深圳', '武汉', '天津', '西安', '南京', '杭州', '成都', '重庆']},
    {fon: 'A', citys: ['阿坝', '阿克苏', '阿拉善盟', '阿勒泰', '安吉', '安康', '安宁', '安平']},
    {fon: 'B', citys: ['白城', '白色', '白山', '保定', '宝鸡', '保山', '包头', '巴中', '北京', '本溪', '滨海']},
    {fon: 'D', citys: ['大理', '大连', '郸城', '丹东', '丹阳', '大庆']},
    {fon: 'E', citys: ['鄂尔多斯', '峨眉山', '恩施', '鄂州']},
    {fon: 'F', citys: ['丰城', '奉化', '凤凰', '凤阳']},
    {fon: 'G', citys: ['阿坝', '阿克苏', '阿拉善盟', '阿勒泰', '安吉', '安康', '安宁', '安平']},
    {fon: 'H', citys: ['白城', '白色', '白山', '保定', '宝鸡', '保山', '包头', '巴中', '北京', '本溪', '滨海']},
    {fon: 'J', citys: ['大理', '大连', '郸城', '丹东', '丹阳', '大庆']},
    {fon: 'K', citys: ['鄂尔多斯', '峨眉山', '恩施', '鄂州']},
    {fon: 'L', citys: ['丰城', '奉化', '凤凰', '凤阳']},
    {fon: 'M', citys: ['阿坝', '阿克苏', '阿拉善盟', '阿勒泰', '安吉', '安康', '安宁', '安平']},
    {fon: 'N', citys: ['白城', '白色', '白山', '保定', '宝鸡', '保山', '包头', '巴中', '北京', '本溪', '滨海']},
    {fon: 'P', citys: ['大理', '大连', '郸城', '丹东', '丹阳', '大庆']},
    {fon: 'Q', citys: ['鄂尔多斯', '峨眉山', '恩施', '鄂州']},
    {fon: 'L', citys: ['丰城', '奉化', '凤凰', '凤阳']},
    {fon: 'S', citys: ['阿坝', '阿克苏', '阿拉善盟', '阿勒泰', '安吉', '安康', '安宁', '安平']},
    {fon: 'T', citys: ['白城', '白色', '白山', '保定', '宝鸡', '保山', '包头', '巴中', '北京', '本溪', '滨海']},
    {fon: 'W', citys: ['大理', '大连', '郸城', '丹东', '丹阳', '大庆']},
    {fon: 'X', citys: ['鄂尔多斯', '峨眉山', '恩施', '鄂州']},
    {fon: 'Y', citys: ['丰城', '奉化', '凤凰', '凤阳']},
    {fon: 'Z', citys: ['阿坝', '阿克苏', '阿拉善盟', '阿勒泰', '安吉', '安康', '安宁', '安平']}];
  req.body.code = '10000';
  req.body.message = '操作成功';
  req.body.success = true;
  return next();
}